# Модуль: Программирование на языке Python (Задание 16)

---

## Видеолекция (10 минут)

### Слайд 1 (0:00–0:30)  
**Заставка:** «Программирование на Python»  
- **Фон:** логотип Python и фрагмент кода.  
- **Текст за кадром:**  
  > Здравствуйте! Сегодня мы разберём основы Python и научимся писать короткие программы для обработки последовательностей.

---

### Слайд 2 (0:30–1:30)  
#### Установка и запуск Python  
- **Пункты на слайде:**  
  1. Скачать с python.org → раздел Download.  
  2. Запустить установщик → «Install Now».  
  3. Проверить в терминале: `python --version`.  
- **Комментарий:**  
  > Python работает на Windows, macOS и Linux. После установки можно писать скрипты в любом текстовом редакторе.

---

### Слайд 3 (1:30–3:00)  
#### Переменные и типы данных  
- **На слайде:**  
  ```python
  a = 5        # int
  b = 10/2     # float → 5.0
  s = "Hello"  # str
**Комментарий:**
```

> Имя переменной — буквы, цифры и нижнее подчёркивание, не начинается с цифры. Операция `=` присваивает значение.

### Слайд 4 (3:00–4:00)

#### Арифметические и логические операции

- **На слайде:**

``` python
x + y, x - y, x * y, x / y, x // y, x % y, x ** y
x < y, x >= y, x == y, x != y
```
> Комментарий:
	 / → float-деление, // → целая часть, % → остаток, ** → степень.

### Слайд 5 (4:00–5:00)
Цикл for

Пункты:

``` python
for i in [2, 3, 5, 7, 11]:
	print(i**2)
for i in range(1, 100):
	if i % 3 != 0:
		print(i)
```
> Комментарий:
	for используется, когда известен набор или диапазон значений.

### Слайд 6 (5:00–6:00)
Цикл while

На слайде:
```python 
prod = 1
count = 0
elem = int(input())
while elem != 0:
	count += 1
	prod *= elem
	elem = int(input())
print(prod)
print(count)
```
> Комментарий:
	while подходит, если число вводимых элементов заранее неизвестно.

### Слайд 7 (6:00–7:30)
Структура решения задания ОГЭ

1. Считать входные данные (до 0).
2. Инициализировать счётчики/результаты.
3. В цикле while:
	- проверить условие;
	- обновить счётчик или сумму/произведение;
    - прочитать следующий элемент.
4. Вывести результат.

### Слайд 8 (7:30–8:30)
Пример из демоверсии ОГЭ-2024

Задача: в последовательности натуральных чисел (заканчивается 0) найти количество двузначных чисел, кратных 4.

Код:

``` python
    a = int(input())
    answer = 0
    while a != 0:
        if 10 <= a < 100 and a % 4 == 0:
            answer += 1
        a = int(input())
    print(answer)
```
> Комментарий:
	Проверяем сразу и «двузначность», и кратность, затем увеличиваем счётчик.

### Слайд 9 (8:30–9:30)
Советы по оформлению

- Разбивайте сложные выражения на части и используйте осмысленные имена переменных.

- Не пишите всё в одну строку — лучше аккуратно отступать.

- Всегда тестируйте на крайних значениях (0, 1, большие числа).

### Слайд 10 (9:30–10:00)
Итоги и анонс семинаров:

Сегодня мы познакомились с базой Python: переменные, циклы, условия. На семинарах напишем и отладим программы для типовых задач ОГЭ.

### План семинара № 1 (45 минут)

1. Введение (5 мин):
	- Обсудить структуру программы: ввод, обработка, вывод.
2. Разбор примера (10 мин):
	- Совместно написать код для подсчёта двузначных чисел, кратных 4.
	- Прогоны на тестах: [12, 8, 0], [16, 20, 99, 0], [4, 100, 44, 0].
3.    Практика в парах (20 мин):
    Каждой паре — по две задачи:
	- Счет отрицательных чисел в последовательности до 0.
	- Сумма трёхзначных чисел, оканчивающихся на 7.
	- Написать программу, протестировать на 3–4 наборах.
4.    Обсуждение (10 мин):
	- Разбор наиболее удачных решений.
	- Типичные ошибки: неверное условие, пропуск чтения следующего элемента.

## План семинара № 2 (45 минут)

1. **Краткое повторение (5 мин):**
    - Циклы и условия в Python.
2. **Решение типовых задач ОГЭ (25 мин):**
    - Лист с 5 задачами:
        1. Подсчёт чисел, кратных k (вводится перед последовательностью).
        2. Поиск максимального числа в последовательности до 0.
        3. Подсчёт чисел с чётной суммой цифр.
        4. Сумма элементов на чётных позициях.
        5. Количество отрицательных и положительных чисел.
    - Индивидуальная работа + проверка в парах.
3. **Усложнённая задача (10 мин):**
    - Последовательность заканчивается двумя нулями подряд.
    - Найти сумму между ними.
    - Обсудить логику и реализовать.
4. **Итоги и домашнее задание:**
    - Составить и решить 3 задачи последовательного ввода с использованием `while` и `if`.

